ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
#include "stm32l4xx_hal.h"
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <inttypes.h>
#include <string.h>
#include "Crc16.h"
//#include "edmi.h"

#define VOSCALEIDX  0
#define IISCALEIDX  1
#define PWSCALEIDX  2
#define PFSCALEIDX  3
#define FRSCALEIDX  4

#define OFFSETTIMESTAMP 	820454400

#define BUFFSIZESTRMK10E  	1500
#define BUFFSIZEMK10E  		1100

// definitions block
//#define SerialMon  	huart1
//#define SerialAT  	huart2
//#define SerialMtr  	huart3

#define MK6N      6
#define MK10E     10

char datastrMK10E[BUFFSIZESTRMK10E];
unsigned char dataMK10E[BUFFSIZEMK10E];
char data2MK10E[20];

bool SerialMtrFlagMK10E;
unsigned short valuecrcMK10E;

int data_lenMK10E;
long timestamp_now;
uint8_t lplen=0, jmlchannel;
long lpfirstentrydate;
long lpfirstentry, lplastentry,lpmaxentry,lprecord;

char meterSNMK10E[10]={'0','0','0','0','0','0','0','0','0','0'};

uint8_t timereq[] = {0x02,0x52,0xF0,0x3D,0x29,0xF9,0x03};
// 0xF78x (max. F788)
//uint8_t instantMK10E[]={0x02,0x52,0xF5,0x30,0x07,0xA1,0x03};
uint8_t instantPFAMK10E[]={0x02,0x52,0xE0,0x23};
uint8_t eobbilltot[]={};
//uint8_t eobenergy[]={0x02,0x52,0xF5,0x4F,0x88,0xD9,0x03};
//uint8_t eobcurrent[]={0x02,0x52,0xF5,0x40,0x79,0x36,0x03};
//uint8_t eobstan[]={0x02,0x52,0xF5,0x4E,0x98,0xF8,0x03};
//uint8_t eobmin1[]={0x02,0x52,0xF5,0x41,0x69,0x17,0x03};
//uint8_t eoblpinit[]={0x02,0x52,0xF5,0x32,0x27,0xE3,0x03};

// variable for eob
double eob0[7],eob1[7],eob2[7],eob3[7],eob4[7],eob9[7];
double eobmd0[7],eobmd1[7],eobmd2[7],eobmd3[7],eobmd4[7],eobmd9[7];
int eobreg[7];

// variable for lp
//uint8_t reglpinit1[11];
int lpdataint[14];
unsigned int lpdatauint[14];
float lpdataf[14];
double lpdatad[14];
int lpreg[14];

extern int lpregm[14];

float commonscale[5];
double lpscaleMK10E[5];

long timestamp;
uint8_t lpintervalMK10E;
// variable for instant
float instantF530[25],instantPF[4];

//extern union myFloat myfloat;
//extern union myInt myint;

bool checkcrcMK10E();
const char* checkregEoBInit1MK10E(int reg);
const char* checkregEoBRate1MK10E(int reg);
const char* checkregEoBRate2MK10E(int reg);
const char* checkregEoBRate3MK10E(int reg);
const char* checkregEoBRate4MK10E(int reg);
const char* checkregEoBRate5MK10E(int reg);
const char* checkregEoBUnifiedMK10E(int reg);

void decodeEoBLpinitMK10E();
void decodeEoBMK10E();

bool decodeInstantMK10E();
void decodeInstantPFMK10E();

void decodelpinitMK10E();
void decodelpscaleMK10E(int a, uint8_t index);
int decodelpdataMK10E();

void lp2JsonMK10E();

void saveEoBDataMK10E();
void saveSNMK10E();

int datasizestrMK10E(char buf[])
{
	int i = 0;
	while(buf[i] != '\0') i++;
	return i+1;
}

void SerialMonprintlnMK10E(char * ptr){
	uint32_t len=strlen(ptr);
	uint8_t ptr1[len+2];
	memcpy(ptr1, (uint8_t *)ptr, len);
	ptr1[len]= 0x0D;
	ptr1[len+1]= 0x0A;
	  HAL_UART_Transmit(&SerialMon, ptr1, len+2, 3000);
}

void SerialMtrprintMK10E(uint8_t * ptr, uint32_t len, uint32_t timeout){
	HAL_UART_Transmit(&SerialMtr, ptr, len, timeout);
}

void SerialMtrreadMK10E(uint8_t ptr[], uint32_t len, uint32_t timeout){
	  HAL_UART_Receive(&SerialMtr, (uint8_t * )ptr, len, timeout);
}

int bufsizeMK10E(unsigned char *buf)
{
	int i = 0;
	while(*buf++ != '\0') i++;
	return i;
}

void dataallclearMK10E(void)
{
	for (int i=0; i < BUFFSIZEMK10E; i++)
	{
		dataMK10E[i] = '\0';
	}
	for (int i=0; i < BUFFSIZEMK10E; i++)
	{
		data2MK10E[i] = '\0';
	}
	for (int i=0; i < BUFFSIZEMK10E; i++)
	{
		datastrMK10E[i] = '\0';
	}
}

void dataclearMK10E(void)
{
	for (int i=0; i < BUFFSIZEMK10E; i++)
	{
		dataMK10E[i] = '\0';
	}
}

void data2clearMK10E(void)
{
	for (int i=0; i < 20; i++)
	{
		data2MK10E[i] = '\0';
	}
}

void datastrclearMK10E(void)
{
	for (int i=0; i < BUFFSIZEMK10E; i++)
	{
		datastrMK10E[i] = '\0';
	}
}

void setPaddingMK10E(){
  unsigned int lentemp=data_lenMK10E, idx=0;
  uint8_t datatemp[data_lenMK10E];
  for(unsigned int i=0;i<data_lenMK10E;i++){
    datatemp[i]=dataMK10E[i];
  }
  for(unsigned int i=0;i<lentemp;i++){
    if(i==0){
      dataMK10E[idx]=0x02;
    }
    else if(i==lentemp-1){
      dataMK10E[idx]=0x03;
    }
    else if((datatemp[i]==0x13 && (i<lentemp-1 && i>0)) || datatemp[i]==0x02 || datatemp[i]==0x10 || datatemp[i]==0x11){
      dataMK10E[idx++]=0x10;
      dataMK10E[idx]=datatemp[i]|0x40;
    }
    else if(i<lentemp-1 && datatemp[i]==0x03){
      dataMK10E[idx++]=0x10;
      dataMK10E[idx]=datatemp[i]|0x40;
    }
    else    dataMK10E[idx]=datatemp[i];
    idx++;
  }
  data_lenMK10E = idx;
}

void setPaddingMK10ELP(){
  unsigned int lentemp=data_lenMK10E, idx=0;
  uint8_t datatemp[data_lenMK10E];
  for(unsigned int i=0;i<data_lenMK10E;i++){
    datatemp[i]=data2MK10E[i];
  }
  for(unsigned int i=0;i<lentemp;i++){
    if(i==0){
      data2MK10E[idx]=0x02;
    }
    else if(i==lentemp-1){
      data2MK10E[idx]=0x03;
    }
    else if((datatemp[i]==0x13 && (i<lentemp-1 && i>0)) || datatemp[i]==0x02 || datatemp[i]==0x10 || datatemp[i]==0x11){
      data2MK10E[idx++]=0x10;
      data2MK10E[idx]=datatemp[i]|0x40;
    }
    else if(i<lentemp-1 && datatemp[i]==0x03){
      data2MK10E[idx++]=0x10;
      data2MK10E[idx]=datatemp[i]|0x40;
    }
    else    data2MK10E[idx]=datatemp[i];
    idx++;
  }
  data_lenMK10E = idx;
}

void setCommandMK10E(uint8_t array[], unsigned int sizearr){
  for(int i=0;i<sizearr;i++){
    dataMK10E[i]=array[i];
  }
  data_lenMK10E = sizearr;
  clearCrc();
   valuecrc = XModemCrc(array,0,sizearr);
   dataMK10E[sizearr+2]=0x03;
   dataMK10E[sizearr+1]= (uint8_t) valuecrc;
   valuecrc  = valuecrc >> 8;
   dataMK10E[sizearr]  = (uint8_t)valuecrc;
   data_lenMK10E = sizearr+3;
   setPaddingMK10E();
}

void setCommandLPMK10E(char array[], unsigned int sizearr){
  for(int i=0;i<sizearr;i++){
    data2MK10E[i]=array[i];
  }
  data_lenMK10E = sizearr;
  clearCrc();
   valuecrc = XModemCrc(array,0,sizearr);
   data2MK10E[sizearr+2]=0x03;
   data2MK10E[sizearr+1]= (uint8_t) valuecrc;
   valuecrc  = valuecrc >> 8;
   data2MK10E[sizearr]  = (uint8_t)valuecrc;
   data_lenMK10E = sizearr+3;
   setPaddingMK10ELP();
}

void removePaddingMK10E(){
  unsigned int lentemp=data_lenMK10E;
  for(unsigned int i=0;i<data_lenMK10E;i++){
    if(dataMK10E[i]==0x10){
    	dataMK10E[i]=dataMK10E[i+1]^0x40;
      for(unsigned int j=i+1;j<data_lenMK10E-1;j++){
    	  dataMK10E[j]=dataMK10E[j+1];
      }
      lentemp--;
    }
  }
  data_lenMK10E = lentemp;
}


void removeheadcrctailMK10E(int sizeheadcmd){
  // remove CRC and Tail
  dataMK10E[data_lenMK10E-1]=0;
  dataMK10E[data_lenMK10E-2]=0;
  dataMK10E[data_lenMK10E-3]=0;
  data_lenMK10E=data_lenMK10E-3;
  //remove head
  for(unsigned int i=0;i<data_lenMK10E;i++){
    if(i+sizeheadcmd<=BUFFSIZEMK10E){
      dataMK10E[i]=dataMK10E[i+sizeheadcmd];
    }
  }
  // update data_lenMK10E
  data_lenMK10E=data_lenMK10E-sizeheadcmd;
}

bool checkcrcMK10E(){
    valuecrc = XModemCrc(data,0,data_len-3);
    unsigned short datacrcfromrx;
    datacrcfromrx = (unsigned short) (data[data_len-3])<<8;
    datacrcfromrx = datacrcfromrx | data[data_len-2];
    if(valuecrc == datacrcfromrx){
      return true;
    }
    else return false;
}

bool getRawDataMK10E(int headcmd){
    clearCrc();
    data_lenMK10E = datasize(dataMK10E);
    removePaddingMK10E();
//    valuecrc = XModemCrc(dataMK10E,0,data_lenMK10E-3);
//    if(checkcrcMK10E()){
//      SerialMonprintln("RemoveHeadCRCTail");
//      printData(dataMK10E,data_lenMK10E);
      removeheadcrctailMK10E(headcmd);
      return true;
//    }
    return true;
}

void saveSNMK10E(){
  if(data_lenMK10E>11) removeheadcrctailMK10E(5);
  for(int i=0;i<data_lenMK10E;i++){
    meterSNMK10E[i] = dataMK10E[i];
  }
//  printf("SN: %s\r\n",meterSNMK10E);
//  HAL_Delay(100);
}

