ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
const char* readSNMK10E(){
	dataallclearMK10E();
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )meterreq, sizeof(meterreq), 100);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, 100, 1000);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
    if(data_lenMK10E>4){
    	SerialMtrFlag=true;
    	saveSNMK10E();
        return meterSNMK10E;
//    	printf("0x%X 0x%X 0x%X 0x%X 0x%X ",dataMK10E[0],dataMK10E[1],dataMK10E[2],dataMK10E[3],dataMK10E[4]);
//    	printf("0x%X 0x%X 0x%X 0x%X 0x%X \r\n",dataMK10E[5],dataMK10E[6],dataMK10E[7],dataMK10E[8],dataMK10E[9]);
//    	SerialMonprintln((char *)dataMK10E);
    }
    return meterSNMK10E;
}

void txSNMK10E_rtos(){
	dataallclearMK10E();
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )meterreq, sizeof(meterreq), 100);
	osDelay(2000);
}

const char* rxSNMK10E_rtos(unsigned char buf[],int len){
	dataallclearMK10E();
	memcpy(dataMK10E,buf,len);
  data_lenMK10E=0;
  data_lenMK10E=datasize(dataMK10E);
    if(data_lenMK10E>4){
    	SerialMtrFlag=true;
    	saveSNMK10E();
        return meterSNMK10E;
//    	printf("0x%X 0x%X 0x%X 0x%X 0x%X ",dataMK10E[0],dataMK10E[1],dataMK10E[2],dataMK10E[3],dataMK10E[4]);
//    	printf("0x%X 0x%X 0x%X 0x%X 0x%X \r\n",dataMK10E[5],dataMK10E[6],dataMK10E[7],dataMK10E[8],dataMK10E[9]);
//    	SerialMonprintln((char *)dataMK10E);
    }
    return meterSNMK10E;
}

long readTimeMK10E(){
	dataallclearMK10E();
	data_lenMK10E=0;
	data2MK10E[0]=0x02;
	data2MK10E[1]=0x52;
	data2MK10E[2]=0xF0;
	data2MK10E[3]=0x3E;
	data2MK10E[4]=0x19;
	data2MK10E[5]=0x9A;
	data2MK10E[6]=0x03;
	data_lenMK10E=7;
    setCommandMK10E((uint8_t *)data2MK10E, data_lenMK10E);
//    printData(data2MK10E,data_lenMK10E);
    HAL_Delay(500);
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )data2MK10E, data_lenMK10E, 100);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, 100, 2000);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
	printf("datalen readtime: %d\n",data_lenMK10E);
    printData(dataMK10E,data_lenMK10E);
    if(getRawDataMK10E(4)){
    	printf("rawdatalen readtime: %d\n",data_lenMK10E);
        printData(dataMK10E,data_lenMK10E);
    timestamp_now = hex2Long(dataMK10E,0);
      timestamp_now = timestamp_now + OFFSETTIMESTAMP;
//      return 1;
    }
    return timestamp_now;
}
// ---------- Decoding and Formating Functions

const char * formatInstantMK10E(uint8_t reg){
  switch(reg){
    case 0:
            return "\"3P59\""; // volt A
            break;
    case 1:
    		return  "\"3P60\""; // volt B
            break;
    case 2:
    		return "\"3P61\""; // volt C
            break;
    case 3:
    		return "\"3P09\""; // current A
            break;
    case 4:
    		return "\"3P10\""; // current B
            break;
    case 5:
    		return "\"3P11\""; // current C
            break;
    case 6:
    		return "\"3P62\""; // phase angle A
            break;
    case 7:
			return "\"3P63\""; // phase angle B
            break;
    case 8:
			return "\"3P64\""; // phase angle C
            break;
    case 15:
			return "\"3P01\""; // phase A Watts
            break;
    case 16:
			return "\"3P02\""; // Phase B Watts
            break;
    case 17:
            return "\"3P03\""; // phase C Watts
            break;
    case 18:
            return "\"3P43\""; // phase A Vars
            break;
    case 19:
            return "\"3P44\""; // phase B Vars
            break;
    case 20:
            return "\"3P45\""; // phase C Vars
            break;
    case 21:
            return "\"3P05\""; // phase A VA
            break;
    case 22:
            return "\"3P06\""; // phase B VA
            break;
    case 23:
            return "\"3P07\""; // phase C VA
            break;
    case 24:
            return "\"3P13\""; // Freq
            break;
    case 25:
            return "PF";
            break;
    default:
            return "\"3P13\""; // Freq
            break;
  }
}

const char * formatInstantPFMK10E(uint8_t reg){
  switch(reg){
    case 0x23:
            return "\"3P39\"";
            break;
    case 0x24:
            return "\"3P40\"";
            break;
    case 0x25:
            return "\"3P41\"";
            break;
    case 0x26:
            return "\"3P42\"";
            break;
    default:
            return "\"3P42\"";
            break;
  }
}

const char * formatLPRegMK10E(int a){
  switch (a){
    case 13315:  return "\"3P66\""; // abs total wh
                break;
    case 13331:  return "\"3P33\""; // total export wh
                break;
    case 13347:  return "\"3P37\""; // total import wh
                break;
    case 13319:  return "\"3P67\""; // abs total varh 0x3407
                break;
    case 13335:  return "\"3P25\""; // total export wh 0x3417
                break;
    case 13351:  return "\"3P29\""; // total import wh 0x3427
                break;
    case 46211:  return "\"3P59\""; // tegangan R
                break;
    case 46212:  return "\"3P60\""; // tegangan S
                break;
    case 46213:  return "\"3P61\""; // tegangan T
                break;
    case 46208:  return "\"3P09\""; // Arus R
                break;
    case 46209:  return "\"3P10\""; // Arus S
                break;
    case 46210:  return "\"3P11\""; // Arus T
                break;
    case 46323  :  return "\"3P42\""; // PF
                break;
    default   :  return "\"3P42\""; // PF
                break;
    
  }
}

const char * formatLPMK10E(uint8_t reg){
  switch(reg){
    case 0x23:
            return "\"3P39\"";
            break;
    case 0x24:
            return "\"3P40\"";
            break;
    case 0x25:
            return "\"3P41\"";
            break;
    case 0x26:
            return "\"3P42\"";
            break;
    default:
        return "\"3P42\"";
            break;
  }
}

void decodeEobLpinitMK10E(){
  int index = 0;
  if(getRawDataMK10E(4)){
//    SerialMonprintlnMK10E();
  }
  hex2Long(dataMK10E,0);
  lpfirstentrydate = myFloat.l;
  lpfirstentrydate += 820454400L;
//  printf("%ld ",lpfirstentrydate);
  index += 8;
  hex2Long(dataMK10E,index);
  lpfirstentry = myFloat.l;
//  printf("%ld ",lpfirstentry);
  index += 8;
  hex2Long(dataMK10E,index);
  lplastentry = myFloat.l;
//  printf("%ld ",lplastentry);
  index += 8;
//  hex2Long(dataMK10E,index);
  uint8_t temp = dataMK10E[index+1];
//  printf("\ntemp:%x ",temp);
  temp = temp & 0x3F;
//  printf("%x ",temp);
  jmlchannel = (uint8_t)temp;
//  printf("jmlch:%d ",jmlchannel);
  temp = dataMK10E[index] << 4;
//  printf("\ntemp:%x ",temp);
  temp = temp >> 2;
//  printf("%x ",temp);
  uint8_t temp1 = dataMK10E[index+1] >> 6;
//  printf("temp1:%x ",temp1);
  temp = temp | temp1;
//  SerialMonprintlnMK10E(temp);
  lpintervalMK10E = (uint8_t)temp;
//  printf("%d \n",lpintervalMK10E);
  index += 4;
  hex2Long(dataMK10E,index);
  commonscale[0]=myFloat.f;
  index += 4;
  hex2Long(dataMK10E,index);
  commonscale[1]=myFloat.f;
  index += 4;
  hex2Long(dataMK10E,index);
  commonscale[2]=myFloat.f;
  index += 4;
  hex2Long(dataMK10E,index);
  commonscale[3]=myFloat.f;
  index += 4;
  hex2Long(dataMK10E,index);
  commonscale[4]=myFloat.f;
  for(int i=0;i<5;i++){
//	  printf("%.5f ",commonscale[i]);
  }
//  printf("\r\n");
  index = 118;
  for(int i=0;i<jmlchannel;i++){
    lpreg[i]=dataMK10E[2*i+index];
    lpreg[i]=lpreg[i]<<8;
    lpreg[i]=lpreg[i] | dataMK10E[2*i+index+1];
    lpregm[i]=lpreg[i];
//	  printf("0x%X ",lpreg[i]);
//    SerialMon.print(" ");
//    SerialMon.print(lpreg[i]);
  }
//  printf("\r\n");
//  SerialMonprintlnMK10E(" ");
  index = 246;
  for(int i=0;i<7;i++){
    eobreg[i]=dataMK10E[2*i+index];
    eobreg[i]=eobreg[i]<<8;
    eobreg[i]=eobreg[i] | dataMK10E[2*i+index+1];
//    printf("0x%X ",eobreg[i]);
//    datastrMK10E=" ";
//    checkregEoBInit1MK10E(eobreg[i]);
//    SerialMonprint(datastrMK10E);
  }
//  printf("\r\n");
//  SerialMonprintlnMK10E();
  decodelpinitMK10E();
}

// -------------------------- Instant ------------------------
void decodeInstantPFMK10E(){
  dataallclearMK10E();
  int3=0;
  uint8_t regPFA=0x23;
  strcpy(datastrMK10E,"{\"mid\":");
  strcat(datastrMK10E, meterSNMK10E);
//  strcat(datastrMK10E, ",\"pid\":\"InstantPFMK10E\",\"readdate\":");
  strcat(datastrMK10E, ",\"pid\":\"InstantPFMK10E\",");
//  data2clearMK10E();
//  sprintf(data2MK10E,"%d,",timestamp_now);
//  strcat(datastrMK10E, data2MK10E);
  for(int i=0; i<3;i++){
    	strcat(datastrMK10E, formatInstantPFMK10E(regPFA+i));
    	strcat(datastrMK10E, ":");
    	data2clearMK10E();
    	sprintf(data2MK10E,"%.5f",instantPF[int3]);
    	int2 = bufsizeMK10E(data2);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
        int3++;
    }
//      formatInstantPFMK10E(regPFA+1);
  	strcat(datastrMK10E, formatInstantPFMK10E(regPFA+1));
  	strcat(datastrMK10E, ":");
  	data2clearMK10E();
  	sprintf(data2MK10E,"%.5f",instantPF[int3]);
  	int2 = bufsizeMK10E(data2);
  	strcat(datastrMK10E, data2MK10E);
  	strcat(datastrMK10E, "}");
        int3++;
    SerialMonprintlnMK10E(datastrMK10E);
}

bool decodeInstantMK10E(){
	//int index=0;
  myFloat.f = 0;
  printf("decode Instant ");
  for(int i=0;i<25;i++){    
	  instantF530[i]=hex2Float(dataMK10E,i*4);
      printf("%.5f ",instantF530[i]);
  }
  printf("%.5f \r\n",instantF530[0]);
  HAL_Delay(1000);
  int1=0;
  int2=0;
  int3=0;
  datastrclearMK10E();
  strcpy(datastrMK10E,"{\"mid\":");
  strcat(datastrMK10E, meterSNMK10E);
  strcat(datastrMK10E, ",\"pid\":\"InstantMK10E\",");
//  strcat(datastrMK10E, ",\"pid\":\"InstantMK10E\",\"readdate\":");
//  data2clearMK10E();
//  sprintf(data2MK10E,"%d,",timestamp_now);
//  strcat(datastrMK10E, data2MK10E);
  for(int i=0; i<9;i++){
	strcat(datastrMK10E, formatInstantMK10E(i));
	strcat(datastrMK10E, ":");
	data2clearMK10E();
	sprintf(data2MK10E,"%.5f",instantF530[int3]);
//	int2 = bufsizeMK10E(data2MK10E);
	strcat(datastrMK10E, data2MK10E);
	strcat(datastrMK10E, ",");
    int1+=4;
    int3++;
  }
  for(int i=0;i<6;i++){
    int1+=4;
    int3++;
  }
  int2 = int1;
  for(int i=0; i<9;i++){
	strcat(datastrMK10E, formatInstantMK10E(int3));
	strcat(datastrMK10E, ":");
	data2clearMK10E();
	sprintf(data2MK10E,"%.5f",instantF530[int3]);
//	int2 = bufsizeMK10E(data2);
	strcat(datastrMK10E, data2MK10E);
	strcat(datastrMK10E, ",");
    int1+=4;
    int3++;
  }
  strcat(datastrMK10E, formatInstantMK10E(int3));
  strcat(datastrMK10E, ":");
  data2clearMK10E();
  sprintf(data2MK10E,"%.5f",instantF530[int3]);
//  int2 = bufsizeMK10E(data2);
  strcat(datastrMK10E, data2MK10E);
  strcat(datastrMK10E, "}");
  int1+=4;
  int3++;
  return true;
//  SerialMonprintln(datastrMK10E);
}

void readInstantMK10E(char* outstr){
  dataallclearMK10E();
  dataMK10E[0]=0x02;
  dataMK10E[1]=0x52;
  dataMK10E[2]=0xF5;
  dataMK10E[3]=0x30;
  dataMK10E[4]=0x07;
  dataMK10E[5]=0xA1;
  dataMK10E[6]=0x03;
  HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 100);
  HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, BUFFSIZEMK10E, 5000);
  data_lenMK10E=0;
  data_lenMK10E=datasize(dataMK10E);
  printf("datasize: %d\r\n",data_lenMK10E);
  HAL_Delay(500);
  if(data_lenMK10E>5){
//    return 1;
//	  getRawDataMK10E(0);
	  removeheadcrctailMK10E(4);
	  printData(dataMK10E,data_lenMK10E);
	  HAL_Delay(1000);
	  printf("Decode InstantMK10E\r\n");
	  HAL_Delay(1000);
	  if(decodeInstantMK10E()){
		  printf("datasizestrMK10E: %d \r\n",datasizestrMK10E(datastrMK10E));
		  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
			  *outstr++=datastrMK10E[i];
		  }
		  printf(outstr);
	  }
  }
//  return "0";
}

void txInstantMK10E(){
  dataallclearMK10E();
  dataMK10E[0]=0x02;
  dataMK10E[1]=0x52;
  dataMK10E[2]=0xF5;
  dataMK10E[3]=0x30;
  dataMK10E[4]=0x07;
  dataMK10E[5]=0xA1;
  dataMK10E[6]=0x03;
  HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 200);
}

