ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
void rxInstantMK10E(char* outstr, unsigned char buf[],int len){
	dataallclearMK10E();
	memcpy(dataMK10E,buf,len);
  data_lenMK10E=0;
  data_lenMK10E=datasize(dataMK10E);
  if(data_lenMK10E>5){
	  removeheadcrctailMK10E(4);
	  if(decodeInstantMK10E()){
//		  printf("datasizestrMK10E: %d \r\n",datasizestrMK10E(datastrMK10E));
		  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
			  *outstr++=datastrMK10E[i];
		  }
//		  printf(outstr);
	  }
  }
//  return "0";
}

void readInstantPFMK10E(){
  uint8_t mydata[4];
  for(int j=0;j<4;j++){
      mydata[j]=instantPFAMK10E[j];
  }
  for(int i=0;i<4;i++){
    mydata[3] = instantPFAMK10E[3]+i;
    datastrclearMK10E();
    data_lenMK10E=sizeof(instantPFAMK10E);
    setCommandMK10E(mydata, 4);
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )data2, data_lenMK10E, 100);
//	SerialMtrread(dataMK10E,BUFFSIZE,5000);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )data2, 100, 5000);
//    readSerialMtrLP(2000);
    getRawDataMK10E(0);
	removeheadcrctailMK10E(4);
    hex2Float(dataMK10E,0);
    instantPF[i]=myFloat.f;
    osDelay(1000);
  }
  decodeInstantPFMK10E(); 
}


// ----------------------- LP --------------------------------

void readLPMK10E(int indexmin1, char* outstr){
	dataallclearMK10E();
	data_lenMK10E = 0;
  //reading 00000400 lp rate1,2,3,4,5,unified for user0-8
  long lpindex = (long)lplastentry-indexmin1;
  lprecord = lpindex;
  data2MK10E[0]=0x02;
  data2MK10E[1]=0x46;
  data2MK10E[2]=0x30;
  data2MK10E[3]=0x00;
  data2MK10E[4]=lpindex>>24;
  data2MK10E[5]=lpindex>>16;
  data2MK10E[6]=lpindex>>8;
  data2MK10E[7]=(uint8_t) lpindex;
  data2MK10E[8]=0x00;
  data2MK10E[9]=0x01;
  data_lenMK10E = 10;
  setCommandLPMK10E(data2MK10E, data_lenMK10E);
//  printf("datalenMK10E: %d\n",data_lenMK10E);
//  printData(data2MK10E, data_lenMK10E);
//  HAL_UART_Transmit(&SerialMon, (uint8_t *)dataMK10E, 10, 100);
  printf("Read LP MK10E \n");
  HAL_Delay(200);
//  HAL_UART_Transmit(&SerialMon, (uint8_t *)data2MK10E, data_lenMK10E, 100);
  HAL_Delay(200);
  HAL_UART_Transmit(&SerialMtr, (uint8_t *)data2MK10E, data_lenMK10E, 100);
  HAL_UART_Receive(&SerialMtr, (uint8_t *)dataMK10E, 100, 17000);
  data_lenMK10E = datasize(dataMK10E);
//  printData(dataMK10E,40);
  printf("\r\ndatasize LPMK10E: %d\n",data_lenMK10E);
  HAL_Delay(500);
  getRawDataMK10E(10);
//  printData(dataMK10E,20);
  decodelpdataMK10E();
  lp2JsonMK10E();
  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
	  *outstr++=datastrMK10E[i];
  }
}

void txLPMK10ERec(int lp_index){
	dataallclearMK10E();
	data_lenMK10E = 0;
  //reading 00000400 lp rate1,2,3,4,5,unified for user0-8
  long lpindex = lp_index;
  lprecord = lpindex;
  data2MK10E[0]=0x02;
  data2MK10E[1]=0x46;
  data2MK10E[2]=0x30;
  data2MK10E[3]=0x00;
  data2MK10E[4]=lpindex>>24;
  data2MK10E[5]=lpindex>>16;
  data2MK10E[6]=lpindex>>8;
  data2MK10E[7]=(uint8_t) lpindex;
  data2MK10E[8]=0x00;
  data2MK10E[9]=0x01;
  data_lenMK10E = 10;
  setCommandLPMK10E(data2MK10E, data_lenMK10E);
  HAL_UART_Transmit(&SerialMtr, (uint8_t *)data2MK10E, data_lenMK10E, 100);
}

void txLPMK10E(int indexmin1){
	dataallclearMK10E();
	data_lenMK10E = 0;
  //reading 00000400 lp rate1,2,3,4,5,unified for user0-8
  long lpindex = (long)lplastentry-indexmin1;
  lprecord = lpindex;
  data2MK10E[0]=0x02;
  data2MK10E[1]=0x46;
  data2MK10E[2]=0x30;
  data2MK10E[3]=0x00;
  data2MK10E[4]=lpindex>>24;
  data2MK10E[5]=lpindex>>16;
  data2MK10E[6]=lpindex>>8;
  data2MK10E[7]=(uint8_t) lpindex;
  data2MK10E[8]=0x00;
  data2MK10E[9]=0x01;
  data_lenMK10E = 10;
  setCommandLPMK10E(data2MK10E, data_lenMK10E);
  HAL_UART_Transmit(&SerialMtr, (uint8_t *)data2MK10E, data_lenMK10E, 100);
}

void rxLPMK10E(char* outstr,char* datain, int len){
	memcpy(dataMK10E,datain,len);
  data_lenMK10E = datasize(dataMK10E);
  if(getRawDataMK10E(10)){
	  decodelpdataMK10E();
	  lp2JsonMK10E();
	  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
		  *outstr++=datastrMK10E[i];
	  }
  }
}

void decodelpscaleMK10E(int a, uint8_t index){
  switch (a){
    case 13315:  lpscaleMK10E[index]=1;
                break;
    case 13331:  lpscaleMK10E[index]=1;
                break;
    case 13347:  lpscaleMK10E[index]=1;
                break;
    case 13319:  lpscaleMK10E[index]=1;
                break;
    case 32027:  lpscaleMK10E[index]=1;
                break;
    case 13351:  lpscaleMK10E[index]=1;
                break;
    case 46211:  lpscaleMK10E[index]=(double)commonscale[VOSCALEIDX];
                break;
    case 46212:  lpscaleMK10E[index]=(double)commonscale[VOSCALEIDX];
                break;
    case 46213:  lpscaleMK10E[index]=(double)commonscale[VOSCALEIDX];
                break;
    case 46208:  lpscaleMK10E[index]=(double)commonscale[IISCALEIDX];
                break;
    case 46209:  lpscaleMK10E[index]=(double)commonscale[IISCALEIDX];
                break;
    case 46210:  lpscaleMK10E[index]=(double)commonscale[IISCALEIDX];
                break;
    case 46323  :  lpscaleMK10E[index]=(double)commonscale[PFSCALEIDX];
                break;
    default:  lpscaleMK10E[index]=1;
                break;    
  }
}

void decodelpinitMK10E(){
//	printf("\nDecode LPInit MK10E\n");
  for(int i=0;i<jmlchannel;i++){
    // scale decode
    decodelpscaleMK10E(lpregm[i],i);
//    decodelpscaleMK10E(lpreg[i],i);
//    printf("0x%X %.5f\n",lpreg[i],lpscaleMK10E[i]);
//    SerialMon.print(lpreg[i]);
//    SerialMon.print(" ");
//    SerialMonprintlnMK10E(lpscaleMK10E[i],7);
  }
//  printf("\r\n");
}

int decodelpdataMK10E(){
  double temp;//, temp1;
  //int dataint;
  for(int i=0;i<jmlchannel;i++){
//    decodelpscaleMK10E(lpreg[i],i);
    decodelpscaleMK10E(lpregm[i],i);
    myInt.i = 0;
    myInt.i = (int)(dataMK10E[i*2+1]);
    myInt.i = myInt.i<<8;
    myInt.i = myInt.i | (int)(dataMK10E[i*2]);
    lpdataint[i] = myInt.i;
    lpdatauint[i] = myInt.ui;
    lpdataf[i]=(float) lpdatauint[i];
    temp=(double)lpdataf[i];
    lpdatad[i]=temp*lpscaleMK10E[i];
//    printf("0x%X %.5f %d %.5f %.5f\r\n",lpreg[i],lpscaleMK10E[i],lpdataint[i],lpdataf[i],lpdatad[i]);
  }
  return 1;
}

