ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
void lp2JsonMK10E(){
//  printData(dataMK10E, data_lenMK10E);
	datastrclearMK10E();
    strcpy(datastrMK10E,"{\"mid\":");
    strcat(datastrMK10E, meterSNMK10E);
    strcat(datastrMK10E, ",\"pid\":\"LPMK10E\",");
//    strcat(datastrMK10E, ",\"pid\":\"LPMK10E\",\"readdate\":");
//      data2clearMK10E();
//      sprintf(data2MK10E,"%d,",timestamp_now);
//      strcat(datastrMK10E, data2MK10E);
      strcat(datastrMK10E, "\"3P65\":");
      data2clearMK10E();
	sprintf(data2MK10E,"%ld,",lprecord);
    strcat(datastrMK10E, data2MK10E);
  for(int i=0;i<jmlchannel;i++){
    if(i<jmlchannel-1){
//      strcat(datastrMK10E, formatLPRegMK10E(lpreg[i]));
      strcat(datastrMK10E, formatLPRegMK10E(lpregm[i]));
      data2clearMK10E();
      sprintf(data2MK10E,":%.5f,",lpdatad[i]);
      strcat(datastrMK10E, data2MK10E);
    }
    else {
//        strcat(datastrMK10E, formatLPRegMK10E(lpreg[i]));
        strcat(datastrMK10E, formatLPRegMK10E(lpregm[i]));
        data2clearMK10E();
        sprintf(data2MK10E,":%.5f}",lpdatad[i]);
        strcat(datastrMK10E, data2MK10E);
    }
  }
}

int readEobLpInitMK10E(){
	dataallclearMK10E();
	data_lenMK10E = 0;
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x32;
	dataMK10E[4]=0x27;
	dataMK10E[5]=0xE3;
	dataMK10E[6]=0x03;
  HAL_UART_Transmit(&SerialMtr, (uint8_t *)dataMK10E, 7, 100);
  HAL_UART_Receive(&SerialMtr, (uint8_t *)dataMK10E, BUFFSIZEMK10E, 7000);
  printData(dataMK10E,datasize(dataMK10E));
  data_lenMK10E = datasize(dataMK10E);
  printf("\r\ndatasizeEOBINIT: %d\n",data_lenMK10E);
  HAL_Delay(500);
  decodeEobLpinitMK10E();
  //  getRawDataMK10E(0);
//  removeheadcrctailMK10E(4);
//  printf("datasizeEOBINIT: %d\n",data_lenMK10E);
//  HAL_Delay(1000);
//  printData(dataMK10E,data_lenMK10E);
//  HAL_Delay(1000);
  return 0;
}

void txEobLpInitMK10E(){
	dataallclearMK10E();
	data_lenMK10E = 0;
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x32;
	dataMK10E[4]=0x27;
	dataMK10E[5]=0xE3;
	dataMK10E[6]=0x03;
  HAL_UART_Transmit(&SerialMtr, (uint8_t *)dataMK10E, 7, 100);
}

void rxEobLpInitMK10E(char* datain, int len){
  memcpy(dataMK10E,datain,len);
  data_lenMK10E = datasize(dataMK10E);
  decodeEobLpinitMK10E();
}

const char * checkregEoBInit1MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P33\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P37\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P25\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P29\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P17\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P21\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3P66\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3P67\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3P69\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return 0;
            break;
  }
}

const char *checkregEoBUnifiedMK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P70\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P76\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P82\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P88\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P94\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P0A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3P6A\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3PCA\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

const char * checkregEoBRate1MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P71\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P77\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P83\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P89\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P95\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P1A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3P7A\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3PDA\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

const char * checkregEoBRate2MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P72\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P78\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P84\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P90\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P96\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P2A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3P8A\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3PEA\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

const char * checkregEoBRate3MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P73\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P79\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P85\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P91\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P97\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P3A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3P9A\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3PFA\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

const char * checkregEoBRate4MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P74\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P80\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P86\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P92\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P98\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P4A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3PAA\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3P0B\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

const char * checkregEoBRate5MK10E(int reg){
  switch(reg){
    case 26899: // 0x6913 export wh tot
    case 27155: // 0x6A13 export wh tot
            return "\"3P75\"";

            break;
    case 26915: //0x6923 import wh tot
    case 27171: // 0x6A23 import wh tot
            return "\"3P81\"";

            break;
    case 26903: // 0x6917 export varh tot
    case 26647: // 0x6817 export varh tot
    case 27159: // 0x6A17 export varh tot
            return "\"3P87\"";

            break;
    case 26919: //0x6927 import varh tot
    case 26663: // 0x6827 import varh tot
    case 27175: // 0x6A27 import varh tot
            return "\"3P93\"";

            break;
    case 26907: // 0x691B export VAh tot
    case 27163: // 0x6A1B export VAh tot
            return "\"3P99\"";

            break;
    case 26923: // 0x692B import VAh tot
    case 27179: // 0x6A2B import VAh tot
            return "\"3P5A\"";

            break;
    case 26883: // 0x6903 abs wh tot
    case 27139: // 0x6A03 abs wh tot
            return "\"3PBA\"";

            break;
    case 27143: // 0x6A07 abs varh tot
            return "\"3P1B\"";

            break;
    case 26724: // 0x6864 varh penalty
            return "\"3PAB\"";

            break;
    case 255:
            return "\"00FF\"";

            break;
    default:
            return "\"00FF\"";
            return 0;
            break;
  }
}

