ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
void decodeEoBMK10E(){
	int1=7;
	datastrclearMK10E();
    strcpy(datastrMK10E,"{\"mid\":");
    strcat(datastrMK10E, meterSNMK10E);
    strcat(datastrMK10E, ",\"pid\":\"EoBMK10E\",");
//    strcat(datastrMK10E, ",\"pid\":\"EoBMK10E\",\"readdate\":");
//  data2clearMK10E();
//  sprintf(data2MK10E,"%d,",timestamp_now);
//  strcat(datastrMK10E, data2MK10E);
  for(int i=0;i<int1;i++){
      int3=0;
    if(i==int1-1){
    	strcat(datastrMK10E, checkregEoBRate1MK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob0[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate2MK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob1[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate3MK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob2[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate4MK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob3[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate5MK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob4[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBUnifiedMK10E(eobreg[int1-1]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob9[int1-1]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, "}");
    }
    else {
    	strcat(datastrMK10E, checkregEoBRate1MK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob0[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate2MK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob1[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate3MK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob2[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate4MK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob3[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBRate5MK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob4[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    	strcat(datastrMK10E, checkregEoBUnifiedMK10E(eobreg[i]));
    	strcat(datastrMK10E, ":");
    	sprintf(data2MK10E,"%.5f",eob9[i]);
    	strcat(datastrMK10E, data2MK10E);
    	strcat(datastrMK10E, ",");
    }
  }
    SerialMonprintlnMK10E(datastrMK10E);
}

// ----------------------- EoB -------------------------------

const char * formatRateMK10E(uint8_t reg){
  switch(reg){
    case 0: // 0x6913 export wh tot
            return "\"3P70\"";

            break;
    case 1: // 0x6A23 import wh tot
            return "\"3P71\"";

            break;
    case 2: // 0x6A17 export varh tot
            return "\"3P72\"";

            break;
    case 3: // 0x6A27 import varh tot
            return "\"3P73\"";

            break;
    case 4: // 0x6A1B export VAh tot
            return "\"3P74\"";

            break;
    case 5: // 0x6A2B import VAh tot
            return "\"3P75\"";

            break;
    default:
        	return "\"3P75\"";
            break;
  }
}


void readEoBCurrentMK10E(char* outstr){
	dataallclearMK10E();
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x40;
	dataMK10E[4]=0x79;
	dataMK10E[5]=0x36;
	dataMK10E[6]=0x03;
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 100);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, BUFFSIZEMK10E, 7000);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
	printf("datasize: %d\r\n",data_lenMK10E);
	HAL_Delay(500);
	if(data_lenMK10E>5){
	//    return 1;
		getRawDataMK10E(4);
//		removeheadcrctailMK10E(4);
		printData(dataMK10E,data_lenMK10E);
		HAL_Delay(500);
		printf("Save Data EoBCurrentMK10E\r\n");
		saveEoBDataMK10E();
		HAL_Delay(500);
		printf("Decode EoBCurrentMK10E\r\n");
		HAL_Delay(500);
		decodeEoBMK10E();
//		decodeInstantMK10E();
		  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
			  *outstr++=datastrMK10E[i];
		  }
	  }
//	  return "0";
}

void txEoBCurrentMK10E(){
	dataallclearMK10E();
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x40;
	dataMK10E[4]=0x79;
	dataMK10E[5]=0x36;
	dataMK10E[6]=0x03;
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 100);
}

void rxEoBCurrentMK10E(char* outstr,char* datain, int len){
	  memcpy(dataMK10E,datain,len);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
	if(data_lenMK10E>5){
		getRawDataMK10E(4);
		saveEoBDataMK10E();
		decodeEoBMK10E();
		  for(int i=0;i<datasizestrMK10E(datastrMK10E);i++){
			  *outstr++=datastrMK10E[i];
		  }
	  }
}

const char* readEoBEnergyMK10E(){
	dataallclearMK10E();
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x4F;
	dataMK10E[4]=0x88;
	dataMK10E[5]=0xD9;
	dataMK10E[6]=0x03;
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 100);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, BUFFSIZEMK10E, 5000);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
	printf("datasize: %d\r\n",data_lenMK10E);
	HAL_Delay(500);
	if(data_lenMK10E>5){
	//    return 1;
		getRawDataMK10E(4);
//		removeheadcrctailMK10E(4);
		printData(dataMK10E,data_lenMK10E);
		HAL_Delay(500);
		printf("Save Data EoBEnergyMK10E\r\n");
		saveEoBDataMK10E();
		HAL_Delay(500);
		printf("Decode EoBEnergyMK10E\r\n");
		HAL_Delay(500);
		decodeEoBMK10E();
//		decodeInstantMK10E();
		return datastrMK10E;
	  }
	  return "0";
}

