ikkholis27/STM32Code/testHW/Core/Inc/edmi_mk10e.h
const char* readEoBStanMK10E(){
	dataallclearMK10E();
	dataMK10E[0]=0x02;
	dataMK10E[1]=0x52;
	dataMK10E[2]=0xF5;
	dataMK10E[3]=0x4E;
	dataMK10E[4]=0x98;
	dataMK10E[5]=0xF8;
	dataMK10E[6]=0x03;
	HAL_UART_Transmit(&SerialMtr, (uint8_t * )dataMK10E, 7, 100);
	HAL_UART_Receive(&SerialMtr, (uint8_t * )dataMK10E, BUFFSIZEMK10E, 5000);//  SerialMonprintlnMK10E(datastrMK10E.length());
//  SerialMonprintlnMK10E(datastrMK10E);
	data_lenMK10E=0;
	data_lenMK10E=datasize(dataMK10E);
	printf("datasize: %d\r\n",data_lenMK10E);
	HAL_Delay(500);
	if(data_lenMK10E>5){
	//    return 1;
		getRawDataMK10E(4);
//		removeheadcrctailMK10E(4);
		printData(dataMK10E,data_lenMK10E);
		HAL_Delay(500);
		printf("Save Data EoBStanMK10E\r\n");
		saveEoBDataMK10E();
		HAL_Delay(500);
		printf("Decode EoBStanMK10E\r\n");
		HAL_Delay(500);
		decodeEoBMK10E();
//		decodeInstantMK10E();
		return datastrMK10E;
	  }
	  return "0";

}

void saveEoBDataMK10E(){
//  removeheadcrctailMK10E(4);
//  printData(dataMK10E, data_lenMK10E);
  SerialMonprintlnMK10E(" ");
  // exp wh
  hex2Float(dataMK10E,0);
  eob9[0]=(double)(myFloat.f);
  hex2Float(dataMK10E,4);
  eob0[0]=(double)(myFloat.f);
  hex2Float(dataMK10E,8);
  eob1[0]=(double)(myFloat.f);
  hex2Float(dataMK10E,12);
  eob2[0]=(double)(myFloat.f);
  // imp wh
  hex2Float(dataMK10E,16);
  eob9[1]=(double)(myFloat.f);
  hex2Float(dataMK10E,20);
  eob0[1]=(double)(myFloat.f);
  hex2Float(dataMK10E,24);
  eob1[1]=(double)(myFloat.f);
  hex2Float(dataMK10E,28);
  eob2[1]=(double)(myFloat.f);
  // exp varh
  hex2Float(dataMK10E,32);
  eob9[2]=(double)(myFloat.f);
  hex2Float(dataMK10E,36);
  eob0[2]=(double)(myFloat.f);
  // imp varh
  hex2Float(dataMK10E,40);
  eob9[3]=(double)(myFloat.f);
  hex2Float(dataMK10E,44);
  eob0[3]=(double)(myFloat.f);
  // abs wh
  hex2Float(dataMK10E,48);
  eob9[4]=(double)(myFloat.f);
  hex2Float(dataMK10E,52);
  eob0[4]=(double)(myFloat.f);
  hex2Float(dataMK10E,56);
  eob1[4]=(double)(myFloat.f);
  hex2Float(dataMK10E,60);
  eob2[4]=(double)(myFloat.f);
  // abs varh
  hex2Float(dataMK10E,64);
  eob9[5]=(double)(myFloat.f);
  hex2Float(dataMK10E,68);
  eob0[5]=(double)(myFloat.f);
  hex2Float(dataMK10E,72);
  eob1[5]=(double)(myFloat.f);
  hex2Float(dataMK10E,76);
  eob2[5]=(double)(myFloat.f);
  // varh penalty
  hex2Float(dataMK10E,80);
  eob9[6]=(double)(myFloat.f);
  hex2Float(dataMK10E,84);
  eob0[6]=(double)(myFloat.f);

//  for(int i=0;i<7;i++){
//    Serial.print(eob9[i], 7);
//    Serial.print(" ");
//    Serial.print(eob0[i], 7);
//    Serial.print(" ");
//    Serial.print(eob1[i], 7);
//    Serial.print(" ");
//    Serial.println(eob2[i], 7);
//  }
}

/*
void readMeterAllFunctionsMK10E() {
      switch(state){
        case 0:
                SerialMonprintlnMK10E("Login to meter");
                if(!loginToMeter()){
                    SerialMonprintlnMK10E("Error Login Meter");
                    return;
                }
//                printData(dataMK10E, data_lenMK10E);
                state++;
                break;
        case 1:
              SerialMonprintlnMK10E("Serial Number");
            if(readSN()){
              saveSN();
//              SerialMonprintlnMK10E();
              printData(meterSNMK10E,sizeof(meterSNMK10E));
              SerialMonprintlnMK10E();
            }
//            sendToServer();
              state++;
              break;
        case 2:
              SerialMonprintlnMK10E("Read Instant");
            if(readInstantMK10E()){
//              decodeInstant();
            }
            if(onlineMode)sendToServer();
              readInstantPFMK10E();
            if(onlineMode)sendToServer();
              state++;
//              state=200;
              break;
        case 3:
              SerialMonprintlnMK10E("Read F532");
            if(readEobLpInitMK10E()){
              decodeEobLpinitMK10E();
            }
              state++;
              state++;
              break;
        case 4:
//         read EoB STAN
              SerialMonprintlnMK10E("Read EoB Stan Billing");
            if(readEoBStanMK10E()){
            }
              state++;
              break;
        case 5:
              SerialMonprintlnMK10E("Read LP");
            if(readLPMK10E(1)){
              // printData(dataMK10E,data_lenMK10E);
              Serial.println();
              decodelpdataMK10E();
              lp2JsonMK10E();
            }
            if(onlineMode)sendToServer();
              state++;
//              state=0;
              break;
        case 6:
//         read EoB Energy
              SerialMonprintlnMK10E("Read EoB Energy F54F");
            if(readEoBEnergyMK10E()){
              saveEoBDataMK10E();
              decodeEoBMK10E();
            }
            if(onlineMode)sendToServer();
              state++;
              break;
        case 7:
//         read EoB Current
              SerialMonprintlnMK10E("Read EoB Current F540");
            if(readEoBCurrentMK10E()){
              saveEoBDataMK10E();
              decodeEoBMK10E();
            }
            if(onlineMode)sendToServer();
              state++;
              state=200;
              break;
        case 8:
            if(readLPMK10E(4)){
            }
              state++;
              break;
        case 9:
            if(readLPMK10E(5)){
            }
              state++;
              break;
         default:
                 state=0;
                 break;        
      }
      delay(500);
}
*/
